---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCFamilyInstanceExtrusionExportResults
source: html/b467d3e1-ea9c-c158-50ce-a980b621ac9f.htm
---
# Autodesk.Revit.DB.IFC.IFCFamilyInstanceExtrusionExportResults

This class represents the results of a geometric analysis of a family instance.

## Syntax (C#)
```csharp
public class IFCFamilyInstanceExtrusionExportResults : IDisposable
```

## Remarks
The analysis attempts to convert the geometry of the instance into a single extrusion with
 additional extruded openings cutting the main solid.